In [1]:
import pandas as pd

# Series

In [56]:
lista = [1, 2, 3, 4, 5]

In [57]:
s = pd.Series(lista)

In [58]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [59]:
index = ['Linha ' + str(i) for i in range(5)]

In [60]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [61]:
s = pd.Series(data = lista, index = index)

In [62]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [64]:
dic = {'Linha ' + str(i) : i + 1 for i in range(5)}

In [65]:
dic

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [66]:
type(dic)

dict

In [67]:
s = pd.Series(dic)

In [68]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [69]:
s1 = s + 2

In [70]:
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [71]:
s2 = s + s1

In [72]:
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

## DataFrame

In [17]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [18]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [19]:
df1 = pd.DataFrame(data = data)

In [20]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
index = ['Linha ' + str(i) for i in range(3)]

In [25]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [26]:
df1 = pd.DataFrame(data = data, index = index)

In [27]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [28]:
columns = ['Coluna ' + str(i) for i in range(3)]

In [29]:
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [30]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [31]:
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [37]:
dicionario = {'Coluna 0' : {'Linha 0' : 1, 'Linha 1' : 4, 'Linha 2': 7}, 
        'Coluna 1' : {'Linha 0' : 2, 'Linha 1' : 5, 'Linha 2' : 8}, 
       'Coluna 2' : {'Linha 0' : 3, 'Linha 1' : 6, 'Linha 2' : 9}}

In [38]:
dicionario

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [39]:
df2 = pd.DataFrame(dicionario)

In [40]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [41]:
tupla = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [42]:
tupla

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [43]:
df3 = pd.DataFrame(tupla, index, columns)

In [44]:
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [45]:
df1[df1 > 0] = 'A'

In [47]:
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [48]:
df2[df2 > 0] = 'B'

In [49]:
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [50]:
df3[df3 > 0] = 'C'

In [51]:
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [52]:
df4 = pd.concat([df1, df2, df3])

In [53]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [54]:
df5 = pd.concat([df1, df2, df3], axis = 1)

In [55]:
df5

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C